CONFIG={
    "1": {
        "exec": "1：碧波鱼池\\effect.exe",
        "name": "1：碧波鱼池"
    },
    "2": {
        "exec": "2：变换棋盘\\effect.exe",
        "name": "2：变换棋盘"
    },
    "3": {
        "exec": "3：春天的鲜花\\effect.exe",
        "name": "3：春天的鲜花"
    },
    "4": {
        "exec": "4：动感花瓣\\effect.exe",
        "name": "4：动感花瓣"
    },
    "5": {
        "exec": "5：肥皂泡泡\\effect.exe",
        "name": "5：肥皂泡泡"
    },
    "6": {
        "exec": "6：枫叶飘舞\\effect.exe",
        "name": "6：枫叶飘舞"
    },
    "7": {
        "exec": "7：钢琴奏响曲\\effect.exe",
        "name": "7：钢琴奏响曲"
    },
    "8": {
        "exec": "8：荷塘月色\\effect.exe",
        "name": "8：荷塘月色"
    },
    "9": {
        "exec": "9：蝴蝶谷\\effect.exe",
        "name": "9：蝴蝶谷"
    },
    "10": {
        "exec": "10：火焰\\effect.exe",
        "name": "10：火焰"
    },
    "11": {
        "exec": "11：锦鲤鱼塘\\effect.exe",
        "name": "11：锦鲤鱼塘"
    },
    "12": {
        "exec": "12：浪漫花朵\\effect.exe",
        "name": "12：浪漫花朵"
    },
    "13": {
        "exec": "13：浪漫花朵2\\effect.exe",
        "name": "13：浪漫花朵2"
    },
    "14": {
        "exec": "14：老电视换台\\effect.exe",
        "name": "14：老电视换台"
    },
    "15": {
        "exec": "15：离子幻化\\effect.exe",
        "name": "15：离子幻化"
    },
    "16": {
        "exec": "16：炼\\effect.exe",
        "name": "16：炼"
    },
    "17": {
        "exec": "17：迷雾森林\\effect.exe",
        "name": "17：迷雾森林"
    },
    "18": {
        "exec": "18：视频飞舞\\effect.exe",
        "name": "18：视频飞舞"
    },
    "19": {
        "exec": "19：视频盒子\\effect.exe",
        "name": "19：视频盒子"
    },
    "20": {
        "exec": "20：守门员\\effect.exe",
        "name": "20：守门员"
    },
    "21": {
        "exec": "21：水波\\effect.exe",
        "name": "21：水波"
    },
    "22": {
        "exec": "22：水波辣椒\\effect.exe",
        "name": "22：水波辣椒"
    },
    "23": {
        "exec": "23：水晶玻璃\\effect.exe",
        "name": "23：水晶玻璃"
    },
    "24": {
        "exec": "24：水晶小球\\effect.exe",
        "name": "24：水晶小球"
    },
    "25": {
        "exec": "25：图片百叶窗\\effect.exe",
        "name": "25：图片百叶窗"
    },
    "26": {
        "exec": "26：图片擦除\\effect.exe",
        "name": "26：图片擦除"
    },
    "27": {
        "exec": "27：图片翻转\\effect.exe",
        "name": "27：图片翻转"
    },
    "28": {
        "exec": "28：图片旋转墙\\effect.exe",
        "name": "28：图片旋转墙"
    },
    "29": {
        "exec": "29：雪玻璃窗\\effect.exe",
        "name": "29：雪玻璃窗"
    },
    "30": {
        "exec": "30：照片回忆\\effect.exe",
        "name": "30：照片回忆"
    },
    "31": {
        "exec": "31：中国祖玛\\effect.exe",
        "name": "31：中国祖玛"
    },
    "32": {
        "exec": "32：足迹\\effect.exe",
        "name": "32：足迹"
    },
    "33": {
        "exec": "33：足球\\effect.exe",
        "name": "33：足球"
    },
    "34": {
        "exec": "34：爱的玫瑰\\爱的玫瑰.cmd",
        "name": "34：爱的玫瑰"
    },
    "35": {
        "exec": "35：爱心蜡烛\\爱心蜡烛.cmd",
        "name": "35：爱心蜡烛"
    },
    "36": {
        "exec": "36：白色小花\\白色小花.cmd",
        "name": "36：白色小花"
    },
    "37": {
        "exec": "37：白色小花2\\白色小花2.cmd",
        "name": "37：白色小花2"
    },
    "38": {
        "exec": "38：保卫披萨\\保卫披萨.cmd",
        "name": "38：保卫披萨"
    },
    "39": {
        "exec": "39：彩球闪亮\\彩球闪亮.cmd",
        "name": "39：彩球闪亮"
    },
    "40": {
        "exec": "40：彩色百叶窗\\彩色百叶窗.cmd",
        "name": "40：彩色百叶窗"
    },
    "41": {
        "exec": "41：彩色小球\\彩色小球.cmd",
        "name": "41：彩色小球"
    },
    "42": {
        "exec": "42：彩色烟雾\\彩色烟雾.cmd",
        "name": "42：彩色烟雾"
    },
    "43": {
        "exec": "43：彩条\\彩条.cmd",
        "name": "43：彩条"
    },
    "44": {
        "exec": "44：产品展示\\产品展示.cmd",
        "name": "44：产品展示"
    },
    "45": {
        "exec": "45：出气机器人\\出气机器人.cmd",
        "name": "45：出气机器人"
    },
    "46": {
        "exec": "46：春之蝶\\春之蝶.cmd",
        "name": "46：春之蝶"
    },
    "47": {
        "exec": "47：打地鼠\\打地鼠.cmd",
        "name": "47：打地鼠"
    },
    "48": {
        "exec": "48：打树虫\\打树虫.cmd",
        "name": "48：打树虫"
    },
    "49": {
        "exec": "49：打碎玻璃\\打碎玻璃.cmd",
        "name": "49：打碎玻璃"
    },
    "50": {
        "exec": "50：弹钢琴\\弹钢琴.cmd",
        "name": "50：弹钢琴"
    },
    "51": {
        "exec": "51：点亮小球\\点亮小球.cmd",
        "name": "51：点亮小球"
    },
    "52": {
        "exec": "52：对称星星\\对称星星.cmd",
        "name": "52：对称星星"
    },
    "53": {
        "exec": "53：飞机降落\\飞机降落.cmd",
        "name": "53：飞机降落"
    },
    "54": {
        "exec": "54：飞龙在天\\飞龙在天.cmd",
        "name": "54：飞龙在天"
    },
    "55": {
        "exec": "55：海底世界\\海底世界.cmd",
        "name": "55：海底世界"
    },
    "56": {
        "exec": "56：海底游鱼\\海底游鱼.cmd",
        "name": "56：海底游鱼"
    },
    "57": {
        "exec": "57：荷塘游鱼\\荷塘游鱼.cmd",
        "name": "57：荷塘游鱼"
    },
    "58": {
        "exec": "58：荷页与蝌蚪\\荷页与蝌蚪.cmd",
        "name": "58：荷页与蝌蚪"
    },
    "59": {
        "exec": "59：花瓣漫舞\\花瓣漫舞.cmd",
        "name": "59：花瓣漫舞"
    },
    "60": {
        "exec": "60：欢迎光临\\欢迎光临.cmd",
        "name": "60：欢迎光临"
    },
    "61": {
        "exec": "61：欢迎您光临\\欢迎您光临.cmd",
        "name": "61：欢迎您光临"
    },
    "62": {
        "exec": "62：黄昏蝙蝠\\黄昏蝙蝠.cmd",
        "name": "62：黄昏蝙蝠"
    },
    "63": {
        "exec": "63：加法算数\\加法算数.cmd",
        "name": "63：加法算数"
    },
    "64": {
        "exec": "64：甲壳虫\\甲壳虫.cmd",
        "name": "64：甲壳虫"
    },
    "65": {
        "exec": "65：架子鼓\\架子鼓.cmd",
        "name": "65：架子鼓"
    },
    "66": {
        "exec": "66：金鱼\\金鱼.cmd",
        "name": "66：金鱼"
    },
    "67": {
        "exec": "67：菊花斑斓\\菊花斑斓.cmd",
        "name": "67：菊花斑斓"
    },
    "68": {
        "exec": "68：恐龙大陆\\恐龙大陆.cmd",
        "name": "68：恐龙大陆"
    },
    "69": {
        "exec": "69：绿色闪电\\绿色闪电.cmd",
        "name": "69：绿色闪电"
    },
    "70": {
        "exec": "70：绿色细胞\\绿色细胞.cmd",
        "name": "70：绿色细胞"
    },
    "71": {
        "exec": "71：麻将桌\\麻将桌.cmd",
        "name": "71：麻将桌"
    },
    "72": {
        "exec": "72：玫瑰花瓣\\玫瑰花瓣.cmd",
        "name": "72：玫瑰花瓣"
    },
    "73": {
        "exec": "73：玫瑰花又开\\玫瑰花又开.cmd",
        "name": "73：玫瑰花又开"
    },
    "74": {
        "exec": "74：梅花飘落\\梅花飘落.cmd",
        "name": "74：梅花飘落"
    },
    "75": {
        "exec": "75：暮色光晕\\暮色光晕.cmd",
        "name": "75：暮色光晕"
    },
    "76": {
        "exec": "76：女人花\\女人花.cmd",
        "name": "76：女人花"
    },
    "77": {
        "exec": "77：拍苍蝇\\拍苍蝇.cmd",
        "name": "77：拍苍蝇"
    },
    "78": {
        "exec": "78：拍气球\\拍气球.cmd",
        "name": "78：拍气球"
    },
    "79": {
        "exec": "79：品牌的力量\\品牌的力量.cmd",
        "name": "79：品牌的力量"
    },
    "80": {
        "exec": "80：品牌展示\\品牌展示.cmd",
        "name": "80：品牌展示"
    },
    "81": {
        "exec": "81：扑克洗牌\\扑克洗牌.cmd",
        "name": "81：扑克洗牌"
    },
    "82": {
        "exec": "82：七彩线条\\七彩线条.cmd",
        "name": "82：七彩线条"
    },
    "83": {
        "exec": "83：七色画板\\七色画板.cmd",
        "name": "83：七色画板"
    },
    "84": {
        "exec": "84：七星瓢虫\\七星瓢虫.cmd",
        "name": "84：七星瓢虫"
    },
    "85": {
        "exec": "85：钱币袋\\钱币袋.cmd",
        "name": "85：钱币袋"
    },
    "86": {
        "exec": "86：如履薄冰\\如履薄冰.cmd",
        "name": "86：如履薄冰"
    },
    "87": {
        "exec": "87：赛车\\赛车.cmd",
        "name": "87：赛车"
    },
    "88": {
        "exec": "88：闪电\\闪电.cmd",
        "name": "88：闪电"
    },
    "89": {
        "exec": "89：升降方块\\升降方块.cmd",
        "name": "89：升降方块"
    },
    "90": {
        "exec": "90：数字方阵\\数字方阵.cmd",
        "name": "90：数字方阵"
    },
    "91": {
        "exec": "91：刷新图片\\刷新图片.cmd",
        "name": "91：刷新图片"
    },
    "92": {
        "exec": "92：水波荷花\\水波荷花.cmd",
        "name": "92：水波荷花"
    },
    "93": {
        "exec": "93：水池游鱼\\水池游鱼.cmd",
        "name": "93：水池游鱼"
    },
    "94": {
        "exec": "94：水果英语\\水果英语.cmd",
        "name": "94：水果英语"
    },
    "95": {
        "exec": "95：水晶世界\\水晶世界.cmd",
        "name": "95：水晶世界"
    },
    "96": {
        "exec": "96：水墨镜像\\水墨镜像.cmd",
        "name": "96：水墨镜像"
    },
    "97": {
        "exec": "97：水中游鱼\\水中游鱼.cmd",
        "name": "97：水中游鱼"
    },
    "98": {
        "exec": "98：四角足球\\四角足球.cmd",
        "name": "98：四角足球"
    },
    "99": {
        "exec": "99：唐诗欣赏\\唐诗欣赏.cmd",
        "name": "99：唐诗欣赏"
    },
    "100": {
        "exec": "100：投球掷物\\投球掷物.cmd",
        "name": "100：投球掷物"
    },
    "101": {
        "exec": "101：图片查看\\图片查看.cmd",
        "name": "101：图片查看"
    },
    "102": {
        "exec": "102：图片离子\\图片离子.cmd",
        "name": "102：图片离子"
    },
    "103": {
        "exec": "103：喂兔子\\喂兔子.cmd",
        "name": "103：喂兔子"
    },
    "104": {
        "exec": "104：温馨小花\\温馨小花.cmd",
        "name": "104：温馨小花"
    },
    "105": {
        "exec": "105：舞蹈美女\\舞蹈美女.cmd",
        "name": "105：舞蹈美女"
    },
    "106": {
        "exec": "106：西红柿\\西红柿.cmd",
        "name": "106：西红柿"
    },
    "107": {
        "exec": "107：心爱玫瑰\\心爱玫瑰.cmd",
        "name": "107：心爱玫瑰"
    },
    "108": {
        "exec": "108：心花怒放\\心花怒放.cmd",
        "name": "108：心花怒放"
    },
    "109": {
        "exec": "109：星光灿烂\\星光灿烂.cmd",
        "name": "109：星光灿烂"
    },
    "110": {
        "exec": "110：雪花飘飘\\雪花飘飘.cmd",
        "name": "110：雪花飘飘"
    },
    "111": {
        "exec": "111：雪山冰块\\雪山冰块.cmd",
        "name": "111：雪山冰块"
    },
    "112": {
        "exec": "112：夜空礼花\\夜空礼花.cmd",
        "name": "112：夜空礼花"
    },
    "113": {
        "exec": "113：音乐放送\\音乐放送.cmd",
        "name": "113：音乐放送"
    },
    "114": {
        "exec": "114：音乐调音台\\音乐调音台.cmd",
        "name": "114：音乐调音台"
    },
    "115": {
        "exec": "115：隐藏的广告\\隐藏的广告.cmd",
        "name": "115：隐藏的广告"
    },
    "116": {
        "exec": "116：鱼池赏鱼\\鱼池赏鱼.cmd",
        "name": "116：鱼池赏鱼"
    },
    "117": {
        "exec": "117：照亮品牌\\照亮品牌.cmd",
        "name": "117：照亮品牌"
    },
    "118": {
        "exec": "118：中秋快乐\\中秋快乐.cmd",
        "name": "118：中秋快乐"
    },
    "119": {
        "exec": "119：重力迷宫\\重力迷宫.cmd",
        "name": "119：重力迷宫"
    },
    "120": {
        "exec": "120：桌面冰球\\桌面冰球.cmd",
        "name": "120：桌面冰球"
    },
    "121": {
        "exec": "121：枫叶情怀\\枫叶情怀.cmd",
        "name": "121：枫叶情怀"
    },
    "122": {
        "exec": "122：海豚游鱼\\海豚游鱼.cmd",
        "name": "122：海豚游鱼"
    },
    "123": {
        "exec": "123：花开大地\\花开大地.cmd",
        "name": "123：花开大地"
    },
    "124": {
        "exec": "124：爵士鼓乐\\爵士鼓乐.cmd",
        "name": "124：爵士鼓乐"
    },
    "125": {
        "exec": "125：涟漪戏鱼\\涟漪戏鱼.cmd",
        "name": "125：涟漪戏鱼"
    },
    "126": {
        "exec": "126：数字雨\\数字雨.cmd",
        "name": "126：数字雨"
    },
    "127": {
        "exec": "127：图片查看\\图片查看.cmd",
        "name": "127：图片查看"
    },
    "128": {
        "exec": "128：虚拟翻牌\\虚拟翻牌.cmd",
        "name": "128：虚拟翻牌"
    },
    "129": {
        "exec": "129：虚拟翻书\\虚拟翻书.cmd",
        "name": "129：虚拟翻书"
    },
    "130": {
        "exec": "130：足球对垒\\足球对垒.cmd",
        "name": "130：足球对垒"
    }
};

function show_list(){
	for(k in CONFIG){
		value = CONFIG[k];
		list_group.innerHTML = list_group.innerHTML+"<li data_key='"+k+"' data_exec='"+value.exec+"'><button  onclick=startProgram('"+value.exec+"')  >"+value.name+"</button></li>  "; 
	}
} 
show_list();
